Autodesk.Revit.DB.Structure.LoadComponent.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.Structure.LoadComponent.Factor
Load component factor.
Since:
2016

Autodesk.Revit.DB.Structure.LoadComponent.LoadCaseOrCombinationId
Load case or combination id.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Since:
2016

Autodesk.Revit.DB.Structure.LoadComponent.#ctor(Autodesk.Revit.DB.ElementId,System.Double)
Constructs a new instance of a LoadComponent.
The load case or combination id.
The load case or combination factor.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2016

Autodesk.Revit.DB.Structure.LoadComponent
An object that represents a load combination component.
Since:
2016